Q1. List any five functions of the pandas library with execution.

read_csv(): This function is used to read data from a CSV file and create a DataFrame.

Example:

In [1]:
import pandas as pd
df = pd.read_csv('IRIS.csv')

head(): It allows you to view the first few rows of a DataFrame to quickly inspect the data.

Example:

In [2]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

filter(): This function is used to filter rows based on a given condition.

Example:

In [3]:
df[df['sepal_length'] > 5]  # Filter rows where 'sepal_length' is greater than 5

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
5             5.4          3.9           1.7          0.4     Iris-setosa
10            5.4          3.7           1.5          0.2     Iris-setosa
14            5.8          4.0           1.2          0.2     Iris-setosa
15            5.7          4.4           1.5          0.4     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[118 rows x 5 columns]

drop(): This function is used to drop specific rows or columns from the DataFrame.

Example:

In [4]:
df.drop(columns=['sepal_width', 'petal_length'])  # Remove 'sepal_width' and 'petal_length' from the DataFrame

     sepal_length  petal_width         species
0             5.1          0.2     Iris-setosa
1             4.9          0.2     Iris-setosa
2             4.7          0.2     Iris-setosa
3             4.6          0.2     Iris-setosa
4             5.0          0.2     Iris-setosa
..            ...          ...             ...
145           6.7          2.3  Iris-virginica
146           6.3          1.9  Iris-virginica
147           6.5          2.0  Iris-virginica
148           6.2          2.3  Iris-virginica
149           5.9          1.8  Iris-virginica

[150 rows x 3 columns]

apply(): This function is used to apply a function to each element in a DataFrame or a specific column.

In [5]:
df['sepal_lenth2'] = df['sepal_length'].apply(lambda x: (x*x))

In [6]:
df

,sepal_length,sepal_width,petal_length,petal_width,species,sepal_lenth2
0,5.1,3.5,1.4,0.2,Iris-setosa,26.01
1,4.9,3.0,1.4,0.2,Iris-setosa,24.01
2,4.7,3.2,1.3,0.2,Iris-setosa,22.09
3,4.6,3.1,1.5,0.2,Iris-setosa,21.16
4,5.0,3.6,1.4,0.2,Iris-setosa,25.00
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica,44.89
146,6.3,2.5,5.0,1.9,Iris-virginica,39.69
147,6.5,3.0,5.2,2.0,Iris-virginica,42.25
148,6.2,3.4,5.4,2.3,Iris-virginica,38.44
149,5.9,3.0,5.1,1.8,Iris-virginica,34.81

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:

def reindex_dataframe(df):
    # Create a new index that starts from 1 and increments by 2
    new_index = pd.Index(range(1, len(df) * 2, 2), name='new_index')

    # Assign the new index to the DataFrame
    df = df.set_index(new_index)

    return df

# Example DataFrame
data = {'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]}
df = pd.DataFrame(data)

# Re-index the DataFrame
new_df = reindex_dataframe(df)

print(new_df)

            A   B   C
new_index
1          10  40  70
3          20  50  80
5          30  60  90

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [8]:
data = {'values' : [10,20,30,40,50] }
df = pd.DataFrame(data)
def first_3_sum(df):
    if 'values' in df.columns :
        first_3_sum = df['values'].head(3).sum()
    return first_3_sum

In [9]:
first_3_sum(df)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [10]:
data = { 'text' : ["that person is very famous", "This boy is very intelligent", "She is very smart", "He is a genious"]}
df = pd.DataFrame(data)

In [11]:
def word_count(df):
    df['word_count'] = df['text'].str.split().str.len()
    return df

In [12]:
df = word_count(df)
df

                           text  word_count
0    that person is very famous           5
1  This boy is very intelligent           5
2             She is very smart           4
3               He is a genious           4

In Pandas, DataFrame.size and DataFrame.shape are attributes that provide different information about a DataFrame:

DataFrame.size:

DataFrame.size returns the total number of elements in the DataFrame, which is equal to the product of the number of rows and the number of columns.
It provides a single integer representing the size of the DataFrame.
It doesn't take any arguments and is used as an attribute, not a method.

In [13]:
df.size

8

DataFrame.shape:

DataFrame.shape returns a tuple representing the dimensions of the DataFrame. It includes two elements: the number of rows and the number of columns.
It provides a more detailed view of the DataFrame's structure, allowing you to see how many rows and columns it has.
It is used as an attribute and does not require parentheses.

In [14]:
df.shape

(4, 2)

Q6. Which function of pandas do we use to read an excel file?                                                               
=> pd.read_excel('file.xlsx')

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [15]:
data = {"Email" :['username@domain.com','john.doe@example.com']}
df = pd.DataFrame(data)
df

                  Email
0   username@domain.com
1  john.doe@example.com

In [16]:
def extract_username(df):
    if 'Email' in df.columns :
        df['Username'] = df['Email'].str.split('@').str[0]
    return df

In [17]:
df = extract_username(df)

In [18]:
df

                  Email  Username
0   username@domain.com  username
1  john.doe@example.com  john.doe

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
         
             A                           B                                         C                                                 
    0        3                           5                                         1                                       
    1        8                           2                                         7                                        
    2        6                           9                                         4                                       
    3        2                           3                                         5                                              
    4        9                           1                                         2


Data Science Masters

Your function should select the following rows:                                                                                     
     |  A B C 
      
1       8 2 7                                                                         
4       9 1 2                                                                                  
The function should return a new DataFrame that contains only the selected rows.

In [19]:
data = {'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C' : [1,7,4,5,2]}
df = pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [20]:
def select_rows(df):
    select = (df['A'] > 5) & (df['B'] < 10)
    selected_rows = df[select]
    return selected_rows

In [21]:
selected_df = select_rows(df)

In [22]:
selected_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [23]:
data = {'values' : [10,20,30,40,50] }
df = pd.DataFrame(data)
df

   values
0      10
1      20
2      30
3      40
4      50

In [24]:
def stats(df):
    if 'values' in df:
        mean = df["values"].mean()
        median = df["values"].median()
        standard_deviation = df["values"].std()
    return  mean,median,standard_deviation

In [25]:
mean,median,staandard_deviation = stats(df)

In [26]:
print("Mean of the values in the 'Values' column.",mean)
print("Median of the values in the 'Values' column.",median)
print("Standard Deviation of the values in the 'Values' column.",staandard_deviation)

Mean of the values in the 'Values' column. 30.0
Median of the values in the 'Values' column. 30.0
Standard Deviation of the values in the 'Values' column. 15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [27]:
df = pd.DataFrame({'Date':['2022-01-01','2022-01-02','2022-01-03','2022-01-04','2022-01-05',
                           '2022-01-06','2022-01-07','2022-01-08','2022-01-09','2022-01-10'],
                   'Sales':[10,20,30,40,50,60,70,80,90,100]})

In [28]:
def calculate_moving_average(df):
    # Sort the DataFrame by the 'Date' column if it's not already sorted
    df = df.sort_values(by='Date')

    # Calculate the moving average using a window of size 7
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

    return df

In [29]:
result_df = calculate_moving_average(df)
result_df

         Date  Sales  MovingAverage
0  2022-01-01     10           10.0
1  2022-01-02     20           15.0
2  2022-01-03     30           20.0
3  2022-01-04     40           25.0
4  2022-01-05     50           30.0
5  2022-01-06     60           35.0
6  2022-01-07     70           40.0
7  2022-01-08     80           50.0
8  2022-01-09     90           60.0
9  2022-01-10    100           70.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:

                                       Date                                                                                                                                                                      
         0                            2023-01-01                                                               
         1                            2023-01-02                                                                          
         2                            2023-01-03                                                                       
         3                            2023-01-04                                                                
         4                            2023-01-05                                      
Your function should create the following DataFrame:

                     Date                                       Weekday                                                  
    0             2023-01-01                                    Sunday                                         
    1             2023-01-02                                    Monday                                                 
    2             2023-01-03                                   Tuesday                                             
    3             2023-01-04                                  Wednesday                                            
    4             2023-01-05                                  Thursday
The function should return the modified DataFrame.

In [31]:
df = pd.DataFrame({"Date":['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})

In [32]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [35]:
def add_weekday_column(df):
    
    df['Date'] = pd.to_datetime(df['Date'])

    # Create a new 'Weekday' column with weekday names
    df['Weekday'] = df['Date'].dt.strftime('%A')

    return df

In [36]:
df = add_weekday_column(df)

In [37]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'

In [39]:
import pandas as pd


def select_rows_by_date(df, start_date, end_date):


    return df[df['Date'].between(start_date, end_date)]




df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-02-01', '2023-02-02'], 'Sales': [10, 20, 30, 40, 50, 60, 70]})
df['Date'] = pd.to_datetime(df['Date'])

df_filtered = select_rows_by_date(df, '2023-01-01', '2023-01-31')

print(df_filtered)

        Date  Sales
0 2023-01-01     10
1 2023-01-02     20
2 2023-01-03     30
3 2023-01-04     40
4 2023-01-05     50

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

To use the basic functions of pandas,  the first and foremost necessary library that needs to be imported is pandas